[Scheme]
name=类王码设置
预设模式=1
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[System]
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

SkinScheme=_default
;当前正在使用的皮肤

ShowInfoMsg=1
;候选窗上是否显示提示信息

InfoTime=5
;提示信息的显示时间，0为始终显示

SmartSymbol=1
;是否启用智能标点功能

EnOnOpen=0
;打开极点时是否处于英文状态

AutoEnStr = www. ftp: http mail. bbs.                               
;输入以上字符串时，自动转为英文状态，回车转回中文
;注：①字符个数不能超过4个，如abcde:是非法的
;    ②组字优先级高于本功能

CurrentScheme=default
;当前正在使用的码表

OnlySeekNormalPhrase=1
;1=仅检索常用词条
;0=所有词条

NoDuplicate=0
;不显示重复候选项
DuplicateAccurate=1
;如果不显示重复候选项，且提示字词全码，须设定此项与上项

ExSeek=1
;是否启用外码提示

PhraseOnFull=0
;全码时才出词组

AutoSelect=1
;2码后、编码唯一时候选项自动上屏

ShiftCharAutoEn =0
;Shift+字母，0直接上屏、1转英文

HalfCharFollowNum=.
;数字后自动半角标点

HalfCharFullSpace=0
;半角标点时输出全角空格

ForceFollow =0
;1=在Opera/FireFox光标跟随
;0=禁用此功能

SplitChar =. 
;序号与候选项间的间隔符，默认为.

CandFollowCursor=1
;候选窗光标跟随

ChinaSymbol=1
;中文标点

FullShape=0
;全角字符

InputMode=17
;输入法当前所处输入模式：五笔、五笔拼音、拼音

EnterFunction=0
;回车键的作用
;0=清除编码
;1=编码上屏

OnlySingleWord=0
;单字检索模式

SoftKeyboardID=4
;Shift+Esc时打开的软键盘

BeepOnError=0
;重码或出错时报警

WaveBeep=0
;用扬声器还是音箱报警
;0=扬声器报警
;1＝音箱报警

CleanWhenError=1
;空码或错码时自动清空，如UseTmpKeyEnd=1，则此项失效

UseTmpKeyEnd=1
;输入编码后，再按临时生僻字键

WildRepeatInput=1
;是否启用万能键重复录入功能

UseAutoPhrase=1
;是否启用自动造词

AutoAdjust=0
;是否启用自动调频

PageNo=0
;上次打开的图形设置页面

PromptUsePhrase=0
;提示系统已有词组

KeySound=0
;是否启用打字音效

Legend=0
;是否启用词语联想

AutoRevise=0
;智能隐藏词组——暂停用
AutoReviseNum=3
;智能隐藏词组的提示次数

UseCommand=1
;是否启用命令直通车

MarkChongKong=0
; 是否启用重码上屏校对模式

ShiftChooseCandidate=0
;是否启用shift键选重码

RShiftSelect2 =1
;用右shift键选第二重码

HideCandWnd=0
;隐藏候选窗

SwitchEnInput=1
;切换到英文状态时，已输编码上屏

PromptEnterInput=0
;联想时按回车是否换行

Big5Code=0
;大五码

InsertSpace=0
;输出内容之间插入特定字符，默认为空格
InsertChar=[ ]
;用户自定义插入字符

SpaceSelect2=0
;空格键选第二重码

MonitorClipboard=1
;是否启用剪切板造词与查询——已停用


MenuSound=0
;状态栏界面音效

ShowSpeed=0
;启用输入速度统计
ReTimingSpan=15
;间断（秒）后重新统计
ShowSpeedSpan=30
;开始统计输入速度的准备时间

NeedReboot=0
;是否需要重启

JianCodeFanText=0
;简入繁出
JianCodeFanTextCode=0
;简入繁出时，候选窗上是否显示繁体

fullview=0
;图形设置是否显示所有选项

CandShowOnTop=1
;候选窗是否顶层显示

ShiftOpenSoft=1
;Shift双击打开软键盘

TiptoolDB=极点汉语词典.db
;候选窗鼠标查询词典

MouseCandTips=1
;是否启用候选窗鼠标查询

szTipToolC=16
;候选窗鼠标查询字号

szTipToolS=16
;状态栏提示窗字号

TipToolFont=宋体
;提示信息字体

零=[○]
;日期中的0用○还是〇（前一个gb2312，后一个GBK）

RMB=[圆]
;自定义大写金额输出“元”还是“圆”

RecInput=0
;是否开启“防断电”功能

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[QuickKey]
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
CN_EN =RShift
;中英文切换键

SwitchKey =disable
;快捷英文及特殊功能引导键
;分号键因为是注释符，所以前面要加一个反斜杠

RarelyPhrase =`
;临时生僻字标志键

SelectSecond =\;
;第二重码选择键

SelectThird ='
;第三重码选择键

PageNext ==
;下一页翻页键

PagePrior =-
;上一页翻页键

ForbiddenQuickKey=0
;禁用所有极点ctrl系列快捷键

QueryCode =/
;Ctrl+此键，反查编码

AddWord ==
;Ctrl+此键，在线加词

DelWord =-
;Ctrl+此键，在线删词

SoftKey =Esc
;Shift+此键，显示软键盘菜单供选择

SwitchSet =m
;Ctrl+此键，检索常用、检索全部字符集切换键

SwitchInputMode =\
;Ctrl+此键，使极点在五笔和五笔拼音之间切换
;用鼠标点击“五笔字型”可以在五笔、五笔拼音和拼音三种状态之间切换

QuickInput=disable
;快捷输入引导键

SwitchPhraseStateKey=Insert
;切换“字”、“词”常用与非常用状态

JianCodeFanTextKey=j
;简入繁出切换键

ShowHideStatus=←
;显隐状态栏快捷键

ShowHideCand=→
;显隐候选窗快捷键

SwitchLib=disable
;词库切换快捷键

InsertSpace=disable
;插入特定字符开关快捷键

SwitchSkin=disable
;皮肤切换快捷键

SmartDel=Backspace
;Ctrl+此键,快速清除刚上屏的词组

SwitchDoubleSymbol=Del
;智能标点开关快捷键

[软键盘]
用户定义=[。，、；：？！…—•ˉˇ¨‘’“”々～‖∶＂＇｀｜〃〔〕〈〉《》「」『』．〖〗【】（）［］中国]
用户定义_上档=[                                               ]
